tutorials/solidMechanics/deprecatedTutorials/icoFsiFoam/flappingConsoleSmall/fluid/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-2   0    -0.1)
    (0    0    -0.1)
    (0.05 0    -0.1)
    (4    0    -0.1)
    (-2   0.6  -0.1)
    (0    0.6  -0.1)
    (0.05 0.6  -0.1)
    (4    0.6  -0.1)
    (-2   1    -0.1)
    (0    1    -0.1)
    (0.05 1    -0.1)
    (4    1    -0.1)

    (-2   0     0.1)
    (0    0     0.1)
    (0.05 0     0.1)
    (4    0     0.1)
    (-2   0.6   0.1)
    (0    0.6   0.1)
    (0.05 0.6   0.1)
    (4    0.6   0.1)
    (-2   1     0.1)
    (0    1     0.1)
    (0.05 1     0.1)
    (4    1     0.1)
);

blocks
(
    hex (0 1 5 4 12 13 17 16) (40 20 1) simpleGrading (0.1 0.2 1)
    hex (2 3 7 6 14 15 19 18) (80 20 1) simpleGrading (10 0.2 1)
    hex (4 5 9 8 16 17 21 20) (40 20 1) simpleGrading (0.1 2 1)
    hex (5 6 10 9 17 18 22 21) (5 20 1) simpleGrading (1 2 1)
    hex (6 7 11 10 18 19 23 22) (80 20 1) simpleGrading (10 2 1)
);

edges
(
);

patches
(
    patch consoleFluid
    (
        (1 13 17 5)
        (5 17 18 6)
        (6 18 14 2)
    )
    wall topWall
    (
        (8 20 21 9)
        (9 21 22 10)
        (10 22 23 11)
    )
    wall bottomWall
    (
        (0 1 13 12)
        (2 3 15 14)
    )
    patch outlet
    (
        (3 7 19 15)
        (7 11 23 19)
    )
    wall inlet
    (
        (0 12 16 4)
        (4 16 20 8)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
