tutorials/solidMechanics/deprecatedTutorials/icoFsiFoam/flappingConsoleSmall/fluid/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           CG;
        preconditioner   Cholesky;

        tolerance        1e-06;
        relTol           0;
    }

    U
    {
        solver           BiCGStab;
        preconditioner   ILU0;

        tolerance        1e-05;
        relTol           0;
    }
}

PISO
{
    nCorrectors     4;
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       0;
}

// ************************************************************************* //
